---
kind: method
id: M:Autodesk.Revit.DB.DimensionType.CanHaveEqualityFormula
source: html/eda97893-d225-4564-471d-dd2f1a4277e5.htm
---
# Autodesk.Revit.DB.DimensionType.CanHaveEqualityFormula Method

Checks whether this DimensionType can have an equality formula.

## Syntax (C#)
```csharp
public bool CanHaveEqualityFormula()
```

## Returns
True when the DimensionType is continuous linear or angular, false otherwise

## Remarks
Equality formulas can be used for continuous linear or angular dimension types.